print('качество: смелость, ум, доброта, хитрость')
print('цель: известность, наука, общение, власть')
x = input()
y = input()
if x == 'смелость' and y == 'известность':
    print('Грифендор')
else:
    if x == 'смелость' and y == 'наука':
        print('Когтевран')
    else:
        if x == 'смелость' and y == 'общение':
            print('Пуффендуй')
        else:
            if x == 'смелость' and y == 'власть':
                print('Слизерин')
            else:
                if x == 'ум' and y == 'известность':
                    print('Грифендор')
                else:
                    if x == 'ум' and y == 'наука':
                        print('Когтевран')
                    else:
                        if x == 'ум' and y == 'общение':
                            print('Пуффендуй')
                        else:
                            if x == 'ум' and y == 'власть':
                                print('Слизерин')
                            else:
                                if x == 'доброта' and y == 'известность':
                                    print('Грифендор')
                                else:
                                    if x == 'доброта' and y == 'наука':
                                        print('Когтевран')
                                    else:
                                        if x == 'доброта' and y == 'общение':
                                            print('Пуффендуй')
                                        else:
                                            if x == 'доброта' and y == 'власть':
                                                print('Слизерин')
                                            else:
                                                if x == 'хитрость' and y == 'известность':
                                                    print('Грифендор')
                                                else:
                                                    if x == 'хитрость' and y == 'наука':
                                                        print('Когтевран')
                                                    else:
                                                        if x == 'хитрость' and y == 'общение':
                                                            print('Пуффендуй')
                                                        else:
                                                            if x == 'хитрость' and y == 'власть':
                                                                print('Слизерин')
                                                            else:
                                                                print('ошибка')

