print('Бывало ли у вас такое, что вас называли слишком легкомысленными?')
a = input()
if a == 'да':
    print('Волос вейлы. Такой сердцевиной у палочки владел Флёр Делякур')
elif a == 'нет':
    print('Это высказывание про вас?: вижу цель не виже припятствий!')
b = input()
if b == 'да':
    print('Сердечная жила дракона. Обладателями такой сердцевины у палочки были: Люциус Малфлой, Гермиона Грейнджер, Златопуст Локонс, Виктор Крам, Беллатриса Лестрейндж, Минерва Макгонагалл, Питер Петтигрю, Гаррик Олливандер, Гораций Слизнорт')
elif b == 'нет':
    print('Вы бы вступили в армию Тёмного Лорда?')
c = input()
if c == 'нет':
    print( 'Волос единорога. Обладателями такой сердцевины у палочки были: Рон Уизли, Драко Малфой, Невилл Долгопупс, Седрик Диггори, Римус Люпин, Квиринус Квиррелл, Мэри Кроткотт')
elif c == 'да':
    print('Вы тщательно выбираете друзей?')
d = input()
if d == 'да':
    print('Перо феникса. Обладателями такой сердцевины у палочки были: Том Реддл, Гарри Поттер, Сильванус Кеттлберн, Селестина Уорлок')
elif d == 'нет':
    print('Увы, вы не волшебник.')